#### Terraform Plan 📝`success`

<details><summary>Show Plan</summary>

```terraform
random_id.this: Refreshing state... [id=QpmL7gGXNng]
module.compute.tls_private_key.ssh: Refreshing state... [id=777cbe0f4f801a1ef6ecbb1573b8a6f1b54ef72e]
module.compute.local_file.private_key: Refreshing state... [id=4aea9b42c6fc5a5910933309fac668fcd3f8de9f]
module.compute.data.aws_ami.amazon_linux: Reading...
module.compute.aws_key_pair.main: Refreshing state... [id=rss-key]
module.networking.data.aws_availability_zones.available: Reading...
data.aws_region.current: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0d5a60e92ea9ef031]
data.aws_caller_identity.current: Reading...
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::890742591881:oidc-provider/token.actions.githubusercontent.com]
module.test_bucket.aws_s3_bucket.this: Refreshing state... [id=test-bucket-42998bee01973678]
aws_s3_bucket.terraform_state: Refreshing state... [id=rss-devops-terraform-state]
data.aws_region.current: Read complete after 0s [id=eu-north-1]
data.aws_caller_identity.current: Read complete after 1s [id=890742591881]
aws_iam_role.github_actions: Refreshing state... [id=GithubActionsRole]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonEC2FullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848247900000004]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/IAMFullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848402200000005]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonVPCFullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848011200000001]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonS3FullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848031600000002]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonRoute53FullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848204200000003]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonSQSFullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848535200000007]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonEventBridgeFullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848463100000006]
module.networking.data.aws_availability_zones.available: Read complete after 1s [id=eu-north-1]
module.compute.data.aws_ami.amazon_linux: Read complete after 2s [id=ami-0da6daf5e3e5ea2a8]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-06843732e6a0ee661]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-07ec59e9ccf201110]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-0c9d0540485dadf54]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-0f7e0b55def6e9796]
module.security.aws_security_group.bastion: Refreshing state... [id=sg-06356fe67a0729ec9]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-0df370d69a460b54b]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-041636c3aa721e47d]
module.security.aws_security_group.public: Refreshing state... [id=sg-062922a138d9d749f]
module.security.aws_security_group.nat: Refreshing state... [id=sg-004b20151e71aed74]
module.networking.aws_default_route_table.public: Refreshing state... [id=rtb-06872d2519e6988dd]
module.security.aws_network_acl.private: Refreshing state... [id=acl-0ea6342011e0888af]
module.security.aws_network_acl.public: Refreshing state... [id=acl-0cc179523f1629f49]
module.security.aws_security_group.private: Refreshing state... [id=sg-03d11c0ab0e2b2e16]
module.compute.aws_instance.bastion: Refreshing state... [id=i-0a61f1e56b9cd1acb]
module.compute.aws_instance.nat: Refreshing state... [id=i-0b37de921800a2330]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07f7fd1c375eef5f1]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05d97631f68d1d0be]
aws_s3_bucket_server_side_encryption_configuration.state: Refreshing state... [id=rss-devops-terraform-state]
aws_s3_bucket_object_lock_configuration.state: Refreshing state... [id=rss-devops-terraform-state]
aws_s3_bucket_versioning.state: Refreshing state... [id=rss-devops-terraform-state]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0223c5646ee52e149]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ee8007a613d30e85]
module.test_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=test-bucket-42998bee01973678]
aws_route.private_nat: Refreshing state... [id=r-rtb-07ec59e9ccf2011101080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.compute.local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "modules/compute/keys/rss-key.pem"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>